#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_s3_bucket.root_bucket: Refreshing state... [id=root-amiblocked.io.website]
aws_dynamodb_table.dynamodb-terraform-state-lock: Refreshing state... [id=example-iac-terraform-state-lock-dynamo]
aws_s3_bucket.www_bucket: Refreshing state... [id=amiblocked.io.website]
aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:811340996907:certificate/e4bee502-483e-4de5-817a-855d40d961a7]
aws_route53_record.default: Refreshing state... [id=Z05643233JO758YN920J2__59f760da3c95b52410a88bcd125496fa.amiblocked.io._CNAME]
aws_acm_certificate_validation.default: Refreshing state... [id=2022-05-28 20:07:29.745 +0000 UTC]
aws_cloudfront_distribution.root_s3_distribution: Refreshing state... [id=E3OFEB4VR1ZF1H]
aws_cloudfront_distribution.www_s3_distribution: Refreshing state... [id=E3967CGP251YI1]
aws_route53_record.www-a: Refreshing state... [id=Z05643233JO758YN920J2_www.amiblocked.io_A]
aws_route53_record.root-a: Refreshing state... [id=Z05643233JO758YN920J2_amiblocked.io_A]
aws_s3_bucket_versioning.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_s3_bucket_acl.root_bucket_acl: Refreshing state... [id=root-amiblocked.io.website,public-read]
aws_s3_bucket_website_configuration.root_bucket_website: Refreshing state... [id=root-amiblocked.io.website]
aws_s3_bucket_website_configuration.www_bucket_website: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_cors_configuration.www_bucket_cors: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_acl.www_bucket_acl: Refreshing state... [id=amiblocked.io.website,public-read]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.www_bucket has changed
  ~ resource "aws_s3_bucket" "www_bucket" {
        id                          = "amiblocked.io.website"
        tags                        = {
            "Project" = "amiblocked.io"
        }
      + website_domain              = "s3-website-us-east-1.amazonaws.com"
      + website_endpoint            = "amiblocked.io.website.s3-website-us-east-1.amazonaws.com"
        # (12 unchanged attributes hidden)


      + website {
          + error_document = "404.html"
          + index_document = "Index.html"
        }
        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_cors_configuration.www_bucket_cors has been deleted
  - resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      - bucket = "amiblocked.io.website" -> null
      - id     = "amiblocked.io.website" -> null

      - cors_rule {
          - allowed_headers = [
              - "Authorization",
              - "Content-Length",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "POST",
            ] -> null
          - allowed_origins = [
              - "https://www.amiblocked.io",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website has been deleted
  - resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      - bucket           = "root-amiblocked.io.website" -> null
      - id               = "root-amiblocked.io.website" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "root-amiblocked.io.website.s3-website-us-east-1.amazonaws.com" -> null

      - redirect_all_requests_to {
          - host_name = "www.amiblocked.io" -> null
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website has changed
  ~ resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
        id               = "amiblocked.io.website"
        # (3 unchanged attributes hidden)

      ~ error_document {
          ~ key = "error.html" -> "404.html"
        }

      ~ index_document {
          ~ suffix = "index.html" -> "Index.html"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_distribution.www_s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "www_s3_distribution" {
        id                             = "E3967CGP251YI1"
        tags                           = {
            "Project" = "amiblocked.io"
        }
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)


          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.www_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "www_bucket" {
        id                          = "amiblocked.io.website"
        tags                        = {
            "Project" = "amiblocked.io"
        }
        # (14 unchanged attributes hidden)


      - website {
          - error_document = "404.html" -> null
          - index_document = "Index.html" -> null
        }
        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_cors_configuration.www_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      + bucket = "amiblocked.io.website"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://www.amiblocked.io",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      + bucket           = "root-amiblocked.io.website"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "www.amiblocked.io"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website will be updated in-place
  ~ resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
        id               = "amiblocked.io.website"
        # (3 unchanged attributes hidden)

      ~ error_document {
          ~ key = "404.html" -> "error.html"
        }

      ~ index_document {
          ~ suffix = "Index.html" -> "index.html"
        }
    }

  # module.cloudfront_lambda.data.archive_file.lambdazip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambdazip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = ".terraform/modules/cloudfront_lambda/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/cloudfront_lambda/lambda"
      + type                = "zip"
    }

  # module.cloudfront_lambda.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudfront_index_rewrite-us-east-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cloudfront_lambda.aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "cloudwatch"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.cloudfront_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = ".terraform/modules/cloudfront_lambda/lambda_function.zip"
      + function_name                  = "cloudfront_index_rewrite"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 5
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.cloudfront_lambda.local_file.config will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + apex_domain_redirect = "true"
              + append_slash         = "false"
              + ghost_hostname       = ""
              + index_rewrite        = "true"
            }
        )
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = ".terraform/modules/cloudfront_lambda/lambda/config.json"
      + id                   = (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @superdug, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*